<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v2.0.0 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of MultiFirefox.</string>
		<key>Identifier</key>
		<string>com.github.anton-prymak.autopkg-repo.download.SPSFirefox</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>SPSFirefox</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>appcast_url</key>
					<string>https://s3.amazonaws.com/mff_sparkle/MultiFirefoxAppcast2.xml</string>
				</dict>
				<key>Processor</key>
				<string>SparkleUpdateInfoProvider</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%-%version%.zip</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
